src/config/Reports/ВНД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Report>
		<Properties>
			<Name>ВНД</Name>
		</Properties>
	</Report>
</MetaDataObject>

src/config/InformationRegisters/РасположениеФирм.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>РасположениеФирм</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сервер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИмяБазы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Логин</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/config/InformationRegisters/АктуальностьОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>АктуальностьОрганизаций</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Активна</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/config/InformationRegisters/Меппинг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>Меппинг</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЧемЗаменять</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ТипДанных</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДанныхМеппинга</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЧтоЗаменять</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/config/Catalogs/Организации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Catalog>
		<Properties>
			<Name>Организации</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ГоловнаяОрганизация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОГРН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеСокращенное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФамилияИП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяИП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтчествоИП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЮридическоеФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЮридическоеФизическоеЛицо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодБСВМММ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Счета7</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодВБазе8</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Бухгалтер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОтветственныеБухгалтеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БазаУТП</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/config/Reports/ВНД/Ext/ManagerModule.bsl
Функция ВнешниеНаборыДанных(ДатаНач, ДатаКон, Организация) Экспорт

	тз = ОписаниеТаблицыРезультата();
	
	//мммСервер.ПолучитьТаблицуСерверов(
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Организации.Ссылка КАК Ссылка,
	|	РасположениеФирмСрезПоследних.Сервер КАК Сервер,
	|	РасположениеФирмСрезПоследних.ИмяБазы КАК База,
	|	РасположениеФирмСрезПоследних.Логин КАК Логин,
	|	РасположениеФирмСрезПоследних.Пароль КАК Пароль
	|ИЗ
	|	Справочник.Организации КАК Организации
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РасположениеФирм.СрезПоследних(&Период) КАК РасположениеФирмСрезПоследних
	|		ПО Организации.Ссылка = РасположениеФирмСрезПоследних.Организация
	|ГДЕ
	|	Организации.ПометкаУдаления = ЛОЖЬ";
	Если ЗначениеЗаполнено(Организация) Тогда
		Запрос.Текст = Запрос.Текст + "
		|	И Организации.Ссылка В (&Ссылка)";
		Запрос.УстановитьПараметр("Ссылка", Организация);
	КонецЕсли;
	Запрос.УстановитьПараметр("Период", ДатаКон);

	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	ТекПодключение = Новый Структура("Прокси,Сервер,База,Логин,Пароль", Неопределено, "","","","");
	Прогон = 1;
	МассивОрганизацийСОшибками = Новый Массив;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ДлительныеОперации.СообщитьПрогресс(Окр(100*Прогон/ВыборкаДетальныеЗаписи.Количество()), СокрЛП(ВыборкаДетальныеЗаписи.Ссылка.НаименованиеСокращенное),);
		Если НЕ ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Сервер)
			ИЛИ НЕ ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.База)
			ИЛИ НЕ ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Логин) Тогда
			Продолжить;
		КонецЕсли;	

		Актуальность = РегистрыСведений.АктуальностьОрганизаций.ПолучитьПоследнее(ДатаКон, Новый Структура("Организация", ВыборкаДетальныеЗаписи.Ссылка));
		Если НЕ Актуальность.Активна Тогда 
			Продолжить;
		КонецЕсли;	

		Попытка
			СоединениеУстановлено = Ложь;
			Для сч = 1 По 3 Цикл
				Попытка
					Прокси = мммСервер.ПолучитьПрокси(ВыборкаДетальныеЗаписи.Сервер, 
						ВыборкаДетальныеЗаписи.База,
						ВыборкаДетальныеЗаписи.Логин,
						ВыборкаДетальныеЗаписи.Пароль
					);
					СоединениеУстановлено = Истина;
					Прервать;
				Исключение
				КонецПопытки;
			КонецЦикла;
			Если НЕ СоединениеУстановлено Тогда
				Продолжить;
			КонецЕсли;	

			///////////////////////////////////////////////////////////////////
			ОСКД = Отчеты.ВНД.ПолучитьМакет("ВНД");

			// сериализуем
			ЗаписьXML = Новый ЗаписьXML;
			ЗаписьXML.УстановитьСтроку();
			СериализаторXDTO.ЗаписатьXML(ЗаписьXML, ОСКД);
			стрОСКД = ЗаписьXML.Закрыть();
			Если ВыборкаДетальныеЗаписи.Ссылка.БазаУТП Тогда
				стрОСКД = СтрЗаменить(стрОСКД, "Организация = &amp;Организация", "");
				стрОСКД = СтрЗаменить(стрОСКД, "ЗНАЧЕНИЕ(Плансчетов.хозрасчетный.РасчетыСПоставщикамиИПодрядчиками)",
					"ЗНАЧЕНИЕ(Плансчетов.хозрасчетный."+РегистрыСведений.Меппинг.ПолучитьЗамену(ВыборкаДетальныеЗаписи.Ссылка, "РасчетыСПоставщикамиИПодрядчиками")+")");
				стрОСКД = СтрЗаменить(стрОСКД, "ЗНАЧЕНИЕ(Плансчетов.хозрасчетный.РасчетыСПокупателямиИЗаказчиками)",
					"ЗНАЧЕНИЕ(Плансчетов.хозрасчетный."+РегистрыСведений.Меппинг.ПолучитьЗамену(ВыборкаДетальныеЗаписи.Ссылка, "РасчетыСПокупателямиИЗаказчиками")+")");
				стрОСКД = СтрЗаменить(стрОСКД, "Счет.Код В (""62.05"")",
					"Счет.Код В ("""+РегистрыСведений.Меппинг.ПолучитьЗамену(ВыборкаДетальныеЗаписи.Ссылка, "62.05")+""")");
				стрОСКД = СтрЗаменить(стрОСКД, "КОГДА ХозрасчетныйОбороты.Счет.Код = ""60.01""",
					"КОГДА ХозрасчетныйОбороты.Счет.Код = """+РегистрыСведений.Меппинг.ПолучитьЗамену(ВыборкаДетальныеЗаписи.Ссылка, "60.01")+"""");
				стрОСКД = СтрЗаменить(стрОСКД, "КОГДА ХозрасчетныйОбороты.Счет.Код = ""62.05""",
					"КОГДА ХозрасчетныйОбороты.Счет.Код = """+РегистрыСведений.Меппинг.ПолучитьЗамену(ВыборкаДетальныеЗаписи.Ссылка, "62.05")+"""");
				стрОСКД = СтрЗаменить(стрОСКД, "Счет.Код = ""60.01""", "Счет.Код = """+ РегистрыСведений.Меппинг.ПолучитьЗамену(ВыборкаДетальныеЗаписи.Ссылка, "60.01") + """");
				стрОСКД = СтрЗаменить(стрОСКД, "КорСчет.Код = ""62.05""", "КорСчет.Код = """+ РегистрыСведений.Меппинг.ПолучитьЗамену(ВыборкаДетальныеЗаписи.Ссылка, "62.05") + """");
			КонецЕсли;

			ВыполняемыйКод = СтрШаблон("
				|// десериализуем макет
				|ЧтениеXML = Новый ЧтениеXML;
				|ЧтениеXML.УстановитьСтроку(""%1"");
				|ОСКД = СериализаторXDTO.ПрочитатьXML(ЧтениеXML);
				|
				|НастройкиОСКД = ОСКД.НастройкиПоУмолчанию;
				|
				|ТаблДокум = Новый ТаблицаЗначений;
				|ПараметрыДанныхОСКД = НастройкиОСКД.ПараметрыДанных.Элементы;
				|ЭлементОрганизация = ПараметрыДанныхОСКД.Найти(""Организация"");
				|ЭлементОрганизация.Использование = Истина;
				|"+?(ВыборкаДетальныеЗаписи.Ссылка.БазаУТП,"Темп = %2;","
				|ЭлементОрганизация.Значение = Справочники.Организации.НайтиПоРеквизиту(""ИНН"", ""%2"");
				|")+"
				|ЭлементНачалоПериода = ПараметрыДанныхОСКД.Найти(""ПериодНач"");
				|ЭлементНачалоПериода.Использование = Истина;
				|ЭлементНачалоПериода.Значение = НачалоДня(Дата(%3));
				|
				|ЭлементКонецПериода = ПараметрыДанныхОСКД.Найти(""ПериодКон"");
				|ЭлементКонецПериода.Использование = Истина;
			//	|ЭлементКонецПериода.Значение = Новый Граница(КонецДня(Дата(%4)),ВидГраницы.Включая);					
				|ЭлементКонецПериода.Значение = КонецДня(Дата(%4));					
				|
				|КомпоновщикМакетаОСКД = Новый КомпоновщикМакетаКомпоновкиДанных;
				|Макет = КомпоновщикМакетаОСКД.Выполнить(ОСКД, НастройкиОСКД,,, Тип(""ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений""));
				|
				|ПроцессорКомпоновкиОСКД = Новый ПроцессорКомпоновкиДанных;
				|ПроцессорКомпоновкиОСКД.Инициализировать(Макет);
				|
				|ПроцессорВыводаОСКД = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
				|ПроцессорВыводаОСКД.УстановитьОбъект(ТаблДокум);
				|ПроцессорВыводаОСКД.Вывести(ПроцессорКомпоновкиОСКД);
				|
				|
				|ВозвращаемоеЗначение = ТаблДокум;
				|"
				, СтрЗаменить(СтрЗаменить(стрОСКД,"""",""""""), Символы.ПС, Символы.ПС+"|")
				, ВыборкаДетальныеЗаписи.Ссылка.ИНН
				, Формат(ДатаНач, "ДФ=yyyy,MM,dd")
				, Формат(ДатаКон, "ДФ=yyyy,MM,dd")
			);

			Ответ = мммСервер.ДеСериализовать(
				Прокси.RunCode(ВыполняемыйКод)
			);

			Если НЕ Ответ.Ошибка Тогда
				//ЧтениеXML = Новый ЧтениеXML;
				//ЧтениеXML.УстановитьСтроку(Ответ.Результат);
				//ТабДок = СериализаторXDTO.ПрочитатьXML(ЧтениеXML);		
				
				Если ТипЗнч(Ответ.Результат) = Тип("ТаблицаЗначений") Тогда
					Для Каждого Стр Из Ответ.Результат Цикл
						Если ПустаяСтрока(Стр.Счет) Тогда
							Продолжить;
						КонецЕсли;	
						
						НоваяСтрока = тз.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрока, Стр);
						НоваяСтрока.Организация = ВыборкаДетальныеЗаписи.Ссылка;
					КонецЦикла;
				КонецЕсли;
			КонецЕсли;
			///////////////////////////////////////////////////////////////////			

		Исключение
			//МассивОрганизацийСОшибками.Добавить(ВыборкаДетальныеЗаписи.Ссылка);
			Сообщить(СтрШаблон("Не удалось выполнить запрос по организации %1", ВыборкаДетальныеЗаписи.Ссылка));
			ЗаписьЖурналаРегистрации("Отчет затраты", УровеньЖурналаРегистрации.Ошибка, ,,ОписаниеОшибки());
		КонецПопытки;
		Прогон = Прогон + 1;
	КонецЦикла;

	Возврат Новый Структура("ВнешнийНабор", тз);

КонецФункции

Функция ОписаниеТаблицыРезультата() Экспорт
	тз = новый ТаблицаЗначений;
	тз.Колонки.Добавить("Счет", Новый ОписаниеТипов("Строка"));
	тз.Колонки.Добавить("Организация");
	тз.Колонки.Добавить("Субконто1", Новый ОписаниеТипов("Строка"));
	тз.Колонки.Добавить("Группа", Новый ОписаниеТипов("Строка"));
	тз.Колонки.Добавить("СуммаНачальныйОстаток", Новый ОписаниеТипов("Число"));
	тз.Колонки.Добавить("СуммаОборотДт", Новый ОписаниеТипов("Число"));
	тз.Колонки.Добавить("СуммаОборотКт", Новый ОписаниеТипов("Число"));
	тз.Колонки.Добавить("СуммаКонечныйОстаток", Новый ОписаниеТипов("Число"));
	Возврат тз;
КонецФункции
